7Ji/esp8266-temp-monitor-and-pc-reset/src/main.cpp
void httpHandleNotFound() {
  server.send_P(404, "text/plain", ErrorNotFound, sizeof(ErrorNotFound) - 1);
}

bool serverIsAuthorized() {
  static String const AuthExpected = String("Bearer " PRIVATE_PC_AUTH);
  static String const HeaderAuthorization = String("Authorization");

  if (!server.hasHeader(HeaderAuthorization)) {
    return false;
  }

  return server.header(HeaderAuthorization) == AuthExpected;
}

void pulseButton(uint8_t const pin) {
  digitalWrite(pin, HIGH);
  delay(250);
  digitalWrite(pin, LOW);
}

void httpHandlePower() {
  if (!serverIsAuthorized()) {
    httpHandleNotFound();
    return;
  }

  pulseButton(PcPinPower);
  server.send_P(200, "text/plain", PcPowerOk, sizeof(PcPowerOk) - 1);
}

void httpHandleReset() {
  if (!serverIsAuthorized()) {
    httpHandleNotFound();
    return;
  }

  pulseButton(PcPinReset);
  server.send_P(200, "text/plain", PcResetOk, sizeof(PcResetOk) - 1);
}

#ifdef PRIVATE_ALLOW_CROSS
void serverSendHeadersForRaw() {
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.sendHeader("Cache-Control", "no-store");
}
#endif

template<typename Each>
struct AllSender {
  Each each;

  void sendRingRecords() {
    uint8_t i;

    for (i = history.headL0; i < history.countL0; ++i) {
      each.sendValue(history.unixSecondsL0[i], history.valuesL0[i]);
    }
    for (i = 0; i < history.headL0; ++i) {
      each.sendValue(history.unixSecondsL0[i], history.valuesL0[i]);
    }
  }

  void sendPage(SensorPage const &page, uint16_t const count = SensorPage::MaxRecords) {
    uint64_t const pageUnixOffset = page.unixOffset;
    SensorRecord const *record;
    uint16_t i;

    for (i = 0; i < count; ++i) {
      record = page.records + i;
      each.sendValue(pageUnixOffset + record->timestamp, record->value);
    }
  }

  void sendSector(uint16_t const sectorID, uint8_t const count) {
    SensorPage *page;
    uint8_t pageID;

    if (!history.fetchSector(sectorID)) {
      return;
    }
    for (pageID = 0, page = history.pagesL2x16; pageID < count; ++pageID, ++page) {
      if (page->valid()) {
        sendPage(*page);
      }
    }
  }

  void sendAll() {
    uint8_t countLast;
    uint16_t sectorCount, sectorCountFirst, sectorOffset, sectorID;

    if (history.countL2 > 0) {
      sectorCount = history.countL2 >> FlashStats::SectPageFactor;
      countLast = history.countL2 & FlashStats::PageInSectMask;
      sectorOffset = history.headL2;
      if (sectorOffset > 0) {
        sectorCountFirst = FlashStats::SectTotal - sectorOffset;
        if (sectorCountFirst > sectorCount) {
          sectorCountFirst = sectorCount;
        }
        for (sectorID = sectorOffset; sectorID < sectorOffset + sectorCountFirst; ++sectorID) {
          sendSector(sectorID, FlashStats::SectPageCount);
        }
        sectorCount -= sectorCountFirst;
      }
      for (sectorID = 0; sectorID < sectorCount; ++sectorID) {
        sendSector(sectorID, FlashStats::SectPageCount);
      }
      if (countLast > 0) {
        sendSector(sectorID, countLast);
      }
    }
    if (history.countL1 > 0) {
      sendPage(history.pageL1, history.countL1);
    }
    if (history.countL0 > 0) {
      sendRingRecords();
    }
  }

  void flushBuffered() {
    if (each.offset) {
      server.sendContent(sharedStrBuffer, each.offset);
      each.offset = 0;
    }
  }
};

struct HistoryEach {
  COMPCONST size_t const lenMax = SharedBufferSize - SensorValue::lenBuffer;

  size_t len;
  size_t offset = 0;

  HistoryEach() {
    server.setContentLength(CONTENT_LENGTH_UNKNOWN);
#ifdef PRIVATE_ALLOW_CROSS
    serverSendHeadersForRaw();
#endif
    server.send(200, "text/plain", "", 0);
  }

  void sendValue(uint64_t const unixSeconds, SensorValue const &value) {
    if (value.intoStr(unixSeconds, sharedStrBuffer + offset, len)) {
      if ((offset += len) >= lenMax) {
        server.sendContent(sharedStrBuffer, offset);
        offset = 0;
      }
    }
  }
};

void httpHandleHistory() {
  AllSender<HistoryEach> sender = {};

  sender.sendAll();
  sender.flushBuffered();
  server.sendContent("", 0);
}

struct DumpEach {
  COMPCONST size_t const lenMax = SharedBufferSize - sizeof(DumpRecord);

  uint64_t unixOffset = 0;
  size_t offset = 0;

  DumpEach() {
    uint32_t const totalCount = history.totalCount();

    server.setContentLength(DumpHeaderSize + totalCount * sizeof(DumpRecord));
#ifdef PRIVATE_ALLOW_CROSS
    serverSendHeadersForRaw();
#endif
    if (totalCount > 0) {
      history.first(unixOffset);
    }
    memcpy(sharedBytesBuffer, "E82\1", 4); /* Magic "E82", dump format version 1 */
    memcpy(sharedBytesBuffer + 4, &totalCount, sizeof(totalCount));
    memcpy(sharedBytesBuffer + 8, &unixOffset, sizeof(unixOffset));
    server.send(200, "application/octet-stream", "", 0);
    server.sendContent(sharedStrBuffer, DumpHeaderSize);
  }

  void sendValue(uint64_t const unixSeconds, SensorValue const &value) {
    DumpRecord *const record = reinterpret_cast<DumpRecord *>(sharedBytesBuffer + offset);

    record->timestamp = unixSeconds - unixOffset;
    record->value = value;
    if ((offset += sizeof(DumpRecord)) >= lenMax) {
      server.sendContent(sharedStrBuffer, offset);
      offset = 0;
    }
  }
};

void httpHandleDump() {
  AllSender<DumpEach> sender = {};

  sender.sendAll();
  sender.flushBuffered();
}

void httpHandleRecent() {
  uint64_t unixSeconds;
  size_t len;

  if (history.last(unixSeconds).intoStr(unixSeconds, sharedStrBuffer, len)) {
#ifdef PRIVATE_ALLOW_CROSS
    serverSendHeadersForRaw();
#endif
    server.send(200, "text/plain", sharedStrBuffer, len);
  }
}

void httpHandleRoot() {
  server.send_P(200, "text/html; charset=utf-8", RootPage, sizeof(RootPage) - 1);
}

void setup() {
  uint32_t millisCurrent;

  pinMode(PcPinPower, OUTPUT);
  digitalWrite(PcPinPower, LOW);
  pinMode(PcPinReset, OUTPUT);
  digitalWrite(PcPinReset, LOW);

  Serial.begin(ConfigBaudRate);
  RecoverFlash::recoverFlash(history.headL2, history.countL2);

  WiFi.setHostname(ConfigHostName);
  WiFi.setAutoReconnect(true);

  millisCurrent = upTimer.currentMillis();
  wifiKeeper.init(millisCurrent);
  ntpSyncer.firstUpdate(millisCurrent);
  history.firstFetchAppend(millisCurrent);

  server.on("/", HTTP_GET, httpHandleRoot);
  server.on("/last", HTTP_GET, httpHandleLast);
  server.on("/temp", HTTP_GET, httpHandleTemp);
  server.on("/humid", HTTP_GET, httpHandleHumid);
  server.on("/power", HTTP_POST, httpHandlePower);
  server.on("/reset", HTTP_POST, httpHandleReset);
  server.on("/recent", HTTP_GET, httpHandleRecent);
  server.on("/history", HTTP_GET, httpHandleHistory);
  server.on("/dump", HTTP_GET, httpHandleDump);
  server.onNotFound(httpHandleNotFound);
  server.begin();

  Serial.println("HTTP Server started");
}

void loop() {
  uint32_t millisCurrent;

  server.handleClient();
  millisCurrent = upTimer.currentMillis();
  wifiKeeper.maybeReconnect(millisCurrent);
  ntpSyncer.maybeUpdate(millisCurrent);
  history.maybeFetchAppend(millisCurrent);
}
